Repository: bitwalker/timex
Catalog: priv/translations/*_latin/LC_MESSAGES/relative_time.po
Languages: bs@latin

source: last month
bs@latin: prošlog mjeseca

source: last week
bs@latin: prošle sedmice

source: last year
bs@latin: prošle godine

source: next month
bs@latin: sljedećeg mjeseca

source: next week
bs@latin: sljedeće sedmice

source: next year
bs@latin: sljedeće godine

source: this month
bs@latin: ovog mjeseca

source: this week
bs@latin: ove sedmice

source: this year
bs@latin: ove godine

source: today
bs@latin: danas

source: tomorrow
bs@latin: sutra

source: yesterday
bs@latin: jučer

source: %{count} day ago
bs@latin: prije %{count} dan

source: %{count} hour ago
bs@latin: prije %{count} sat

source: %{count} minute ago
bs@latin: prije %{count} minutu

source: %{count} month ago
bs@latin: prije %{count} mjesec

source: %{count} second ago
bs@latin: prije %{count} sekundu

source: %{count} week ago
bs@latin: prije %{count} sedmicu

source: %{count} year ago
bs@latin: prije %{count} godinu

source: in %{count} day
bs@latin: za %{count} dan

source: in %{count} hour
bs@latin: za %{count} sat

source: in %{count} minute
bs@latin: za %{count} minutu

source: in %{count} month
bs@latin: za %{count} mjesec

source: in %{count} second
bs@latin: za %{count} sekundu

source: in %{count} week
bs@latin: za %{count} sedmicu

source: in %{count} year
bs@latin: za %{count} godinu

source: last friday
bs@latin: prošlog petka

source: last monday
bs@latin: prošlog ponedjeljka

source: last saturday
bs@latin: prošle subote

source: last sunday
bs@latin: prošle nedjelje

source: last thursday
bs@latin: prošlog četvrtka

source: last tuesday
bs@latin: prošlog utorka

source: last wednesday
bs@latin: prošle srijede

source: next friday
bs@latin: sljedećeg petka

source: next monday
bs@latin: sljedećeg ponedjeljka

source: next saturday
bs@latin: sljedeće subote

source: next sunday
bs@latin: sljedeće nedjelje

source: next thursday
bs@latin: sljedećeg četvrtka

source: next tuesday
bs@latin: sljedećeg utorka

source: next wednesday
bs@latin: sljedeće srijede

source: this friday
bs@latin: u petak

source: this monday
bs@latin: u ponedjeljak

source: this saturday
bs@latin: u subotu

source: this sunday
bs@latin: u nedjelju

source: this thursday
bs@latin: u četvrtak

source: this tuesday
bs@latin: u utorak

source: this wednesday
bs@latin: u srijedu

source: now
bs@latin: sad
