Repository: bitwalker/timex
Catalog: priv/translations/*_latin/LC_MESSAGES/units.po
Languages: bs@latin

source: %{count} day
bs@latin: %{count} dan

source: %{count} hour
bs@latin: %{count} sat

source: %{count} microsecond
bs@latin: %{count} mikrosekunda

source: %{count} millisecond
bs@latin: %{count} milisekunda

source: %{count} minute
bs@latin: %{count} minuta

source: %{count} month
bs@latin: %{count} mjesec

source: %{count} nanosecond
bs@latin: %{count} nanosekunda

source: %{count} second
bs@latin: %{count} sekunda

source: %{count} week
bs@latin: %{count} sedmica

source: %{count} year
bs@latin: %{count} godina
