Repository: bitwalker/timex
Catalog: priv/translations/*_cyrillic/LC_MESSAGES/units.po
Languages: bs@cyrillic

source: %{count} day
bs@cyrillic: %{count} дан

source: %{count} hour
bs@cyrillic: %{count} сат

source: %{count} microsecond
bs@cyrillic: %{count} микросекунда

source: %{count} millisecond
bs@cyrillic: %{count} милисекунда

source: %{count} minute
bs@cyrillic: %{count} минута

source: %{count} month
bs@cyrillic: %{count} мјесец

source: %{count} nanosecond
bs@cyrillic: %{count} наносекунда

source: %{count} second
bs@cyrillic: %{count} секунда

source: %{count} week
bs@cyrillic: %{count} седмица

source: %{count} year
bs@cyrillic: %{count} година
