Repository: bitwalker/timex
Catalog: priv/translations/*/LC_MESSAGES/relative_time.po
Languages: af, ca, cs, da, et, fr, he, hu, it, ja, km, ko, lv, mk, nb_no, nl, pl, pt_br, ro, ru, sr_latn, sv, tr, uk, vi

source: last month
af: verlede maand
ca: el mes passat
cs: minulý měsíc
da: sidste måned
et: eelmine kuu
fr: le mois dernier
he: חודש שעבר
hu: múlt hónap
it: ultimo mese
ja: 先月
km: ខែមុន
ko: 지난 달
lv: pagāšmēnes
mk: минатиот месец
nb_no: forrige måned
nl: vorige maand
pl: zeszły miesiąc
pt_br: mês passado
ro: ultima luna
ru: в прошлом месяце
sr_latn: prošlog meseca
sv: förra månaden
tr: geçen ay
uk: минулого місяця
vi: tháng trước

source: last week
af: verlede week
ca: la setmana passada
cs: minulý týden
da: sidste uge
et: eelmine nädal
fr: la semaine dernière
he: שבוע שעבר
hu: múlt hét
it: ultima settimana
ja: 先週
km: សប្តាហ៍មុន
ko: 지난 주
lv: pagāšnedēļ
mk: минатата седмица
nb_no: forrige uke
nl: vorige week
pl: zeszły tydzień
pt_br: semana passada
ro: ultima saptamana
ru: на прошлой неделе
sr_latn: prošle nedelje
sv: förra veckan
tr: geçen hafta
uk: минулого тижня
vi: tuần trước

source: last year
af: laas jaar
ca: l'any passat
cs: minulý rok
da: sidste år
et: eelmine aasta
fr: l’année dernière
he: שנה שעברה
hu: tavaly
it: ultimo anno
ja: 去年
km: ឆ្នាំមុន
ko: 작년
lv: pagāšgad
mk: минатата година
nb_no: forrige år
nl: vorig jaar
pl: zeszły rok
pt_br: ano passado
ro: ultimul an
ru: в прошлом году
sr_latn: prošle godine
sv: förra året
tr: geçen yıl
uk: минулого року
vi: năm trước

source: next month
af: volgende maand
ca: el mes que ve
cs: příští měsíc
da: næste måned
et: järgmine kuu
fr: le mois prochain
he: חודש הבא
hu: következő hónap
it: prossimo mese
ja: 来月
km: ខែក្រោយ
ko: 다음 달
lv: nākammēness
mk: следен месец
nb_no: neste måned
nl: volgende maand
pl: przyszły miesiąc
pt_br: ano que vem
ro: luna urmatoare
ru: в следующем месяце
sr_latn: sledećeg meseca
sv: nästa månad
tr: gelecek ay
uk: наступного місяця
vi: tháng sau

source: next week
af: volgende week
ca: pròxima setmana
cs: příští týden
da: næste uge
et: järgmine nädal
fr: la semaine prochaine
he: שבוע הבא
hu: következő hét
it: prossima settimana
ja: 来週
km: សប្តាហ៍ក្រោយ
ko: 다음 주
lv: nākamnedēļ
mk: следна седмица
nb_no: neste uke
nl: volgende week
pl: przyszły tydzień
pt_br: semana que vem
ro: saptamana urmatoare
ru: на следующей неделе
sr_latn: sledeće nedelje
sv: nästa vecka
tr: gelecek hafta
uk: на наступній неділі
vi: tuần sau

source: next year
af: volgende jaar
ca: l'any que vé
cs: příští rok
da: næste år
et: järgmine aasta
fr: l’année prochaine
he: שנה הבאה
hu: közvetkező év
it: prossimo year
ja: 来年
km: ឆ្នាំក្រោយ
ko: 내년
lv: nākamgad
mk: следна година
nb_no: neste år
nl: volgend jaar
pl: przyszły rok
pt_br: ano que vem
ro: anul urmator
ru: в следующем году
sr_latn: sledeće godine
sv: nästa år
tr: gelecek yıl
uk: наступного року
vi: năm sau

source: this month
af: hierdie maand
ca: aquest mes
cs: tento měsíc
da: denne måned
et: see kuu
fr: ce mois-ci
he: החודש
hu: ebben a hónapban
it: questo mese
ja: 今月
km: ខែនេះ
ko: 이번 달
lv: šomēness
mk: овој месец
nb_no: denne måned
nl: deze maand
pl: ten miesiąc
pt_br: este mês
ro: luna aceasta
ru: в этом месяце
sr_latn: ovog meseca
sv: denna månad
tr: bu ay
uk: цього місяця
vi: tháng này

source: this week
af: hierdie week
ca: aquesta setmana
cs: tento týden
da: denne uge
et: see nädal
fr: cette semaine
he: השבוע
hu: ezen a héten
it: questa settimana
ja: 今週
km: សប្តាហ៍នេះ
ko: 이번 주
lv: šonedēļ
mk: оваа седмица
nb_no: denne uke
nl: deze week
pl: ten tydzień
pt_br: esta semana
ro: saptamana aceasta
ru: на этой неделе
sr_latn: ove nedelje
sv: denna vecka
tr: bu hafta
uk: цієї неділі
vi: tuần này

source: this year
af: hierdie jaar
ca: aquest any
cs: tento rok
da: dette år
et: see aasta
fr: cette année
he: השנה
hu: idén
it: questo anno
ja: 今年
km: ឆ្នាំនេះ
ko: 올해
lv: šogad
mk: оваа година
nb_no: dette år
nl: dit jaar
pl: ten rok
pt_br: este ano
ro: anul acesta
ru: в этому году
sr_latn: ove godine
sv: detta år
tr: bu yıl
uk: цього року
vi: năm nay

source: today
af: vandag
ca: avui
cs: dnes
da: i dag
et: täna
fr: aujourd’hui
he: היום
hu: ma
it: oggi
ja: 今日
km: ថ្ងៃនេះ
ko: 오늘
lv: šodien
mk: денес
nb_no: i dag
nl: vandaag
pl: dziś
pt_br: hoje
ro: astazi
ru: сегодня
sr_latn: danas
sv: idag
tr: bugün
uk: сьогодні
vi: hôm nay

source: tomorrow
af: m√¥re
ca: demá
cs: zítra
da: i morgen
et: homme
fr: demain
he: מחר
hu: holnap
it: domani
ja: 明日
km: ថ្ងៃស្អែក
ko: 내일
lv: rīt
mk: утре
nb_no: i morgen
nl: morgen
pl: jutro
pt_br: amanhã
ro: maine
ru: завтра
sr_latn: sutra
sv: imorgon
tr: yarın
uk: завтра
vi: ngày mai

source: yesterday
af: gister
ca: ahir
cs: včera
da: i går
et: eile
fr: hier
he: אתמול
hu: tegnap
it: ieri
ja: 昨日
km: ម្សិលមិញ
ko: 어제
lv: vakar
mk: вчера
nb_no: i går
nl: gisteren
pl: wczoraj
pt_br: ontem
ro: ieri
ru: вчера
sr_latn: juče
sv: igår
tr: dün
uk: вчора
vi: hôm qua

source: %{count} day ago
af: %{count} dag gelede
ca: fa %{count} dia
cs: před %{count} dnem
da: %{count} dag siden
et: %{count} päev tagasi
fr: il y a %{count} jour
he: אתמול
hu: %{count} napja
it: %{count} giorno fa
ja: %{count}日前
km: %{count} ថ្ងៃមុន
ko: %{count}일 전
lv: pirms %{count} dienas
mk: пред %{count} ден
nb_no: %{count} dag siden
nl: %{count} dag geleden
pl: %{count} dzień temu
pt_br: %{count} dia atrás
ro: %{count} zi in urma
ru: %{count} день назад
sr_latn: pre %{count} dan
sv: %{count} dag sedan
tr: %{count} gün önce
uk: %{count} день тому
vi: %{count} ngày trước

source: %{count} hour ago
af: %{count} huur gelede
ca: fa %{count} hora
cs: před %{count} hodinou
da: %{count} time siden
et: %{count} tund tagasi
fr: il y a %{count} heure
he: לפני שעה
hu: %{count} órája
it: %{count} ora fa
ja: %{count}時間前
km: %{count} ម៉ោងមុន
ko: %{count}시간 전
lv: pirms %{count} stundas
mk: пред %{count} час
nb_no: %{count} time siden
nl: %{count} uur geleden
pl: %{count} godzinę temu
pt_br: %{count} hora atrás
ro: %{count} ora in urma
ru: %{count} час назад
sr_latn: pre %{count} sat
sv: %{count} timme sedan
tr: %{count} saat önce
uk: %{count} годину тому
vi: %{count} giờ trước

source: %{count} minute ago
af: %{count} minuut gelede
ca: fa %{count} minut
cs: před %{count} minutou
da: %{count} minut siden
et: %{count} minut tagasi
fr: il y a %{count} minute
he: לפני דקה
hu: %{count} perce
it: %{count} minuto fa
ja: %{count}分前
km: %{count} នាទីមុន
ko: %{count}분 전
lv: pirms %{count} minūtes
mk: пред %{count} минута
nb_no: %{count} minutt siden
nl: %{count} minuut geleden
pl: %{count} minutę temu
pt_br: %{count} minuto atrás
ro: %{count} minut in urma
ru: %{count} минуту назад
sr_latn: pre %{count} minut
sv: %{count} minut sedan
tr: %{count} dakika önce
uk: %{count} хвилину тому
vi: %{count} phút trước

source: %{count} month ago
af: %{count} maand gelede
ca: fa %{count} mes
cs: před %{count} měsícem
da: %{count} måned siden
et: %{count} kuu tagasi
fr: il y a %{count} mois
he: לפני חודש
hu: %{count} hónapja
it: %{count} mese fa
ja: %{count}ヶ月前
km: %{count} ខែមុន
ko: %{count}달 전
lv: pirms %{count} mēneša
mk: пред %{count} месец
nb_no: %{count} måned siden
nl: %{count} maand geleden
pl: %{count} miesiąc temu
pt_br: %{count} mês atrás
ro: %{count} luna in urma
ru: %{count} месяц назад
sr_latn: pre %{count} mesec
sv: %{count} månad sedan
tr: %{count} ay önce
uk: %{count} місяць тому
vi: %{count} tháng trước

source: %{count} second ago
af: %{count} sekonde gelede
ca: fa %{count} segon
cs: před %{count} sekundou
da: %{count} sekund siden
et: %{count} kuud tagasi
fr: il y a %{count} seconde
he: לפני שניה
hu: %{count} másodperce
it: %{count} secondo fa
ja: %{count}秒前
km: %{count} វិនាទីមុន
ko: %{count}초 전
lv: pirms %{count} sekundes
mk: пред %{count} секунда
nb_no: %{count} sekund siden
nl: %{count} seconde geleden
pl: %{count} sekunda temu
pt_br: %{count} segundo atrás
ro: %{count} secunda in urma
ru: %{count} секунду назад
sr_latn: pre %{count} sekunda
sv: %{count} sekund sedan
tr: %{count} saniye önce
uk: %{count} секунду тому
vi: %{count} giây trước

source: %{count} week ago
af: %{count} week gelede
ca: fa %{count} setmana
cs: před %{count} týdnem
da: %{count} uge siden
et: %{count} nädal tagasi
fr: il y a %{count} semaine
he: לפני שבוע
hu: %{count} hete
it: %{count} settimana fa
ja: %{count}週間前
km: %{count} សប្តាហ៍មុន
ko: %{count}주 전
lv: pirms %{count} nedēļas
mk: пред %{count} седмица
nb_no: %{count} uke siden
nl: %{count} week geleden
pl: %{count} tydzień temu
pt_br: %{count} semana atrás
ro: %{count} saptamana in urma
ru: %{count} неделю назад
sr_latn: pre %{count} nedelju
sv: %{count} vecka sedan
tr: %{count} hafta önce
uk: %{count} тиждень тому
vi: %{count} tuần trước

source: %{count} year ago
af: %{count} jaar gelede
ca: fa %{count} any
cs: před %{count} rokem
da: %{count} år siden
et: %{count} aasta tagasi
fr: il y a %{count} an
he: לפני שנה
hu: %{count} éve
it: %{count} anno fa
ja: %{count}年前
km: %{count} ឆ្នាំមុន
ko: %{count}년 전
lv: pirms %{count} gada
mk: пред %{count} година
nb_no: %{count} år siden
nl: %{count} jaar geleden
pl: %{count} rok temu
pt_br: %{count} ano atrás
ro: %{count} an in urma
ru: %{count} год назад
sr_latn: pre %{count} godinu
sv: %{count} år sedan
tr: %{count} yıl önce
uk: %{count} рік тому
vi: %{count} năm trước

source: in %{count} day
af: in %{count} dag
ca: en %{count} dia
cs: za %{count} den
da: om %{count} dag
et: %{count} päeva pärast
fr: dans %{count} jour
he: בעוד יום
hu: %{count} nap múlva
it: in %{count} giorno
ja: %{count}日後
km: ក្នុង %{count} ថ្ងៃ
ko: %{count}일 후
lv: pēc %{count} dienas
mk: за %{count} ден
nb_no: om %{count} dag
nl: over %{count} dag
pl: za %{count} dzień
pt_br: em %{count} dia
ro: in %{count} zi
ru: через %{count} день
sr_latn: za %{count} dan
sv: om %{count} dag
tr: %{count} gün içinde
uk: через %{count} день
vi: trong %{count} ngày

source: in %{count} hour
af: oor %{count} uur
ca: en %{count} hora
cs: za %{count} hodinu
da: om %{count} time
et: %{count} tunni pärast
fr: dans %{count} heure
he: בעוד שעה
hu: %{count} óra múlva
it: in %{count} ora
ja: %{count}時間後
km: ក្នុង %{count} ម៉ោង
ko: %{count}시간 후
lv: pēc %{count} stundas
mk: за %{count} час
nb_no: om %{count} time
nl: over %{count} uur
pl: za %{count} godzinę
pt_br: em %{count} hora
ro: in %{count} ora
ru: через %{count} час
sr_latn: za %{count} sat
sv: om %{count} timme
tr: %{count} saat içinde
uk: через %{count} годину
vi: trong %{count} giờ

source: in %{count} minute
af: oor %{count} minuut
ca: en %{count} minut
cs: za %{count} minutu
da: om %{count} minut
et: %{count} minuti pärast
fr: dans %{count} minute
he: בעוד דקה
hu: %{count} perc múlva
it: in %{count} minuto
ja: %{count}分後
km: ក្នុង %{count} នាទី
ko: %{count}분 후
lv: pēc %{count} minūtes
mk: за %{count} минута
nb_no: om %{count} minutt
nl: over %{count} minuut
pl: za %{count} minutę
pt_br: em %{count} minuto
ro: in %{count} minut
ru: через %{count} минуту
sr_latn: za %{count} minut
sv: om %{count} minut
tr: %{count} dakika içinde
uk: через %{count} хвилину
vi: trong %{count} phút

source: in %{count} month
af: in %{count} maand
ca: en %{count} mes
cs: za %{count} měsíc
da: om %{count} måned
et: %{count} kuu pärast
fr: dans %{count} mois
he: בעוד חודש
hu: %{count} hónap múlva
it: in %{count} mese
ja: %{count}ヶ月後
km: ក្នុង %{count} ខែ
ko: %{count}개월 후
lv: pēc %{count} mēneša
mk: за %{count} месец
nb_no: om %{count} måned
nl: over %{count} maand
pl: za %{count} miesiąc
pt_br: em %{count} mês
ro: in %{count} luna
ru: через %{count} месяц
sr_latn: za %{count} mesec
sv: om %{count} månad
tr: %{count} ay içinde
uk: через %{count} місяць
vi: trong %{count} tháng

source: in %{count} second
af: in %{count} sekondes
ca: en %{count} segon
cs: za %{count} sekundu
da: om %{count} sekund
et: %{count} sekundi pärast
fr: dans %{count} seconde
he: בעוד שניה
hu: %{count} másodperc múlva
it: in %{count} secondo
ja: %{count}秒後
km: ក្នុង %{count} វិនាទី
ko: %{count}초 후
lv: pēc %{count} sekundes
mk: за %{count} секунда
nb_no: om %{count} sekund
nl: over %{count} seconde
pl: za %{count} sekundę
pt_br: em %{count} segundo
ro: in %{count} secunda
ru: через %{count} секунду
sr_latn: za %{count} sekundu
sv: om %{count} sekund
tr: %{count} saniye içinde
uk: через %{count} секунду
vi: trong %{count} giây

source: in %{count} week
ca: en %{count} setmana
cs: za %{count} týden
da: om %{count} uge
et: %{count} nädala pärast
fr: dans %{count} semaine
he: בעוד שבוע
hu: %{count} hét múlva
it: in %{count} settimana
ja: %{count}週間後
km: ក្នុង %{count} សប្តាហ៍
ko: %{count}주 후
lv: pēc %{count} nedēļas
mk: за %{count} седмица
nb_no: om %{count} uke
nl: over %{count} week
pl: za %{count} tydzień
pt_br: em %{count} semana
ro: in %{count} saptamana
ru: через %{count} неделю
sr_latn: za %{count} nedelju
sv: om %{count} vecka
tr: %{count} hafta içinde
uk: через %{count} тиждень
vi: trong %{count} tuần

source: in %{count} year
af: in %{count} jaar
ca: en %{count} any
cs: za %{count} rok
da: om %{count} år
et: %{count} aasta pärast
fr: dans %{count} an
he: בעוד שנה
hu: %{count} év múlva
it: in %{count} anno
ja: %{count}年後
km: ក្នុង %{count} ឆ្នាំ
ko: %{count}년 후
lv: pēc %{count} gada
mk: за %{count} година
nb_no: om %{count} år
nl: over %{count} jaar
pl: za %{count} rok
pt_br: em %{count} ano
ro: in %{count} an
ru: через %{count} год
sr_latn: za %{count} godinu
sv: om %{count} år
tr: %{count} yıl içinde
uk: через %{count} рік
vi: trong %{count} năm

source: last friday
af: laas Vrydag
ca: divendres passat
cs: minulý pátek
da: sidste fredag
et: eelmine reede
fr: vendredi dernier
he: שישי האחרון
hu: múlt pénteken
it: ultimo venerdì
ja: 先週の金曜日
km: ថ្ងៃសុក្រមុន
ko: 지난 금요일
lv: pagāšpiektdien
mk: минатиот петок
nb_no: sist fredag
nl: afgelopen vrijdag
pl: zeszły piątek
pt_br: última sexta-feira
ro: vinerea trecuta
ru: в прошлую пятницу
sr_latn: prošlog petka
sv: förra fredagen
tr: geçen cuma
uk: минулої п'ятниці
vi: thứ 6 trước

source: last monday
af: laas Maandag
ca: dilluns passat
cs: minulé pondělí
da: sidste mandag
et: eelmine esmaspäev
fr: lundi dernier
he: שני האחרון
hu: múlt hétfőn
it: ultimo lunedì
ja: 先週の月曜日
km: ថ្ងៃច័ន្ទមុន
ko: 지난 월요일
lv: pagāšpirmdien
mk: минатиот понеделник
nb_no: sist mandag
nl: afgelopen maandag
pl: zeszły poniedziałek
pt_br: última segunda-feira
ro: lunea trecuta
ru: в прошлый понедельник
sr_latn: prošlog ponedeljka
sv: förra måndagen
tr: geçen pazartesi
uk: минулого понеділку
vi: thứ 2 trước

source: last saturday
af: laas Saterdag
ca: dissabte passat
cs: minulou sobotu
da: sidste lørdag
et: eelmine laupäev
fr: samedi dernier
he: שבת האחרונה
hu: múlt szombaton
it: ultimo sabato
ja: 先週の土曜日
km: ថ្ងៃសៅរ៍មុន
ko: 지난 토요일
lv: pagāšsestdien
mk: минатата сабота
nb_no: sist lørdag
nl: afgelopen zaterdag
pl: zeszła sobota
pt_br: último sábado
ro: sambata trecuta
ru: в прошлую субботу
sr_latn: prošle subote
sv: förra lördagen
tr: geçen cumartesi
uk: минулої суботи
vi: thứ 7 trước

source: last sunday
af: laas Sondag
ca: diumenge passat
cs: minulou neděli
da: sidste søndag
et: eelmine pühapäev
fr: dimanche dernier
he: ראשון האחרון
hu: múlt vasárnap
it: ultima domenica
ja: 先週の日曜日
km: ថ្ងៃអាទិត្យមុន
ko: 지난 일요일
lv: pagāšsvētdien
mk: минатата недела
nb_no: sist søndag
nl: afgelopen zondag
pl: zeszła niedziela
pt_br: último domingo
ro: duminica trecuta
ru: в прошлое воскресенье
sr_latn: prošle nedelje
sv: förra söndagen
tr: geçen pazar
uk: минулої неділі
vi: chủ nhật trước

source: last thursday
af: laas Donderdag
ca: dijous passat
cs: minulý čtvrtek
da: sidste torsdag
et: eelmine neljapäev
fr: jeudi dernier
he: חמישי האחרון
hu: múlt csütörtökön
it: ultimo giovedì
ja: 先週の木曜日
km: ថ្ងៃព្រហស្បតិ៍មុន
ko: 지난 목요일
lv: pagāšceturtdien
mk: минатиот четврток
nb_no: sist torsdag
nl: afgelopen donderdag
pl: zeszły czwartek
pt_br: última quinta-feira
ro: joia trecuta
ru: в прошлый четверг
sr_latn: prošlog četvrtka
sv: förra torsdagen
tr: geçen perşembe
uk: минулого четверга
vi: thứ 5 trước

source: last tuesday
af: laas Dinsdag
ca: dimarts passat
cs: minulé úterý
da: sidste tirsdag
et: eelmine teisipäev
fr: mardi dernier
he: שלישי האחרון
hu: múlt kedden
it: ultimo martedì
ja: 先週の火曜日
km: ថ្ងៃអង្គារមុន
ko: 지난 화요일
lv: pagāšotrdien
mk: минатиот вторник
nb_no: sist tirsdag
nl: afgelopen dinsdag
pl: zeszły wtorek
pt_br: última terça-feira
ro: martea trecuta
ru: в прошлый вторник
sr_latn: prošlog utorka
sv: förra tisdagen
tr: geçen salı
uk: в минулий вівторок
vi: thứ 3 trước

source: last wednesday
af: laas Woensdag
ca: dimecres passat
cs: minulou stredu
da: sidste onsdag
et: eelmine kolmapäev
fr: mercredi dernier
he: רביעי האחרון
hu: múlt szerdán
it: ultimo mercoledì
ja: 先週の水曜日
km: ថ្ងៃពុធមុន
ko: 지난 수요일
lv: pagāštrešdien
mk: минатата среда
nb_no: sist onsdag
nl: afgelopen woensdag
pl: zeszła środa
pt_br: última quarta-feira
ro: miercurea trecuta
ru: в прошлую среду
sr_latn: prošle srede
sv: förra onsdagen
tr: geçen çarşamba
uk: в минулу середу
vi: thứ 4 trước

source: next friday
af: volgende Vrydag
ca: el próxim divendres
cs: příští pátek
da: næste fredag
et: järgmine reede
fr: vendredi prochain
he: שישי הבא
hu: következő pénteken
it: prossimo venerdì
ja: 来週の金曜日
km: ថ្ងៃសុក្រក្រោយ
ko: 다음 금요일
lv: nākampiektdien
mk: следен петок
nb_no: neste fredag
nl: aankomende vrijdag
pl: przyszły piątek
pt_br: próxima sexta-feira
ro: vinerea viitoare
ru: в следующую пятницу
sr_latn: sledećeg petka
sv: nästa fredag
tr: gelecek cuma
uk: наступної п'ятниці
vi: thứ 6 tới

source: next monday
af: volgende Maandag
ca: el próxim dilluns
cs: příští pondělí
da: næste mandag
et: järgmine esmaspäev
fr: lundi prochain
he: שני הבא
hu: következő hétfőn
it: prossimo lunedì
ja: 来週の月曜日
km: ថ្ងៃច័ន្ទក្រោយ
ko: 다음 월요일
lv: nākampirmdien
mk: следен понеделник
nb_no: neste mandag
nl: aankomende maandag
pl: przyszły poniedziałek
pt_br: próxima segunda-feira
ro: lunea viitoare
ru: в следующий понедельник
sr_latn: sledećeg ponedeljka
sv: nästa måndag
tr: gelecek pazartesi
uk: наступного понеділка
vi: thứ 2 tới

source: next saturday
af: volgende Saterdag
ca: el próxim dissabte
cs: příští sobotu
da: næste lørdag
et: järgmine laupäev
fr: samedi prochain
he: שבת הבאה
hu: következő szombaton
it: prossimo sabato
ja: 来週の土曜日
km: ថ្ងៃសៅរ៍ក្រោយ
ko: 다음 토요일
lv: nākamsestdien
mk: следната сабота
nb_no: neste lørdag
nl: aankomende zaterdag
pl: przyszła sobota
pt_br: próximo sábado
ro: sambata viitoare
ru: в следующую субботу
sr_latn: sledeće subote
sv: nästa lördag
tr: gelecek cumartesi
uk: наступної суботи
vi: thứ 7 tới

source: next sunday
af: volgende Sondag
ca: el próxim diumenge
cs: příští neděli
da: næste søndag
et: järgmine pühapäev
fr: dimanche prochain
he: ראשון הבא
hu: következő vasárnap
it: prossima domenica
ja: 来週の日曜日
km: ថ្ងៃអាទិត្យក្រោយ
ko: 다음 일요일
lv: nākamsvētdien
mk: следната недела
nb_no: neste søndag
nl: aankomende zondag
pl: przyszła niedziela
pt_br: próximo domingo
ro: duminica viitoare
ru: в следующее воскресенье
sr_latn: sledeće nedelje
sv: nästa söndag
tr: gelecek pazar
uk: наступної неділі
vi: chủ nhật tới

source: next thursday
af: volgende Donderdag
ca: el próxim dijous
cs: příští čtvrtek
da: næste torsdag
et: järgmine neljapäev
fr: jeudi prochain
he: חמישי הבא
hu: következő csütörtökön
it: prossimo giovedì
ja: 来週の木曜日
km: ថ្ងៃព្រហស្បតិ៍ក្រោយ
ko: 다음 목요일
lv: nākamceturtdien
mk: следен четврток
nb_no: neste torsdag
nl: aankomende donderdag
pl: przyszły czwartek
pt_br: próxima quinta-feira
ro: joia viitoare
ru: в следующий четверг
sr_latn: sledećeg četvrtka
sv: nästa torsdag
tr: gelecek perşembe
uk: в наступний четвер
vi: thứ 5 tới

source: next tuesday
af: volgende Dinsdag
ca: el próxim dimarts
cs: příští úterý
da: næste tirsdag
et: järgmine teisipäev
fr: mardi prochain
he: שלישי הבא
hu: következő kedden
it: prossimo martedì
ja: 来週の火曜日
km: ថ្ងៃអង្គារក្រោយ
ko: 다음 화요일
lv: nākamotrdien
mk: следен вторник
nb_no: neste tirsdag
nl: aankomende dinsdag
pl: przyszły wtorek
pt_br: próxima terça-feira
ro: martea viitoare
ru: в следующий вторник
sr_latn: sledećeg utorka
sv: nästa tisdag
tr: gelecek salı
uk: в наступний вівторок
vi: thứ 3 tới

source: next wednesday
af: volgende Woensdag
ca: el próxim dimecres
cs: příští neděli
da: næste onsdag
et: järgmine kolmapäev
fr: mercredi prochain
he: רביעי הבא
hu: következő szerdán
it: prossimo mercoledì
ja: 来週の水曜日
km: ថ្ងៃពុធក្រោយ
ko: 다음 수요일
lv: nākamtrešdien
mk: следната среда
nb_no: neste onsdag
nl: aankomende woensdag
pl: przyszła środa
pt_br: próxima quarta-feira
ro: miercurea viitoare
ru: в следующую среду
sr_latn: sledeće srede
sv: nästa onsdag
tr: gelecek çarşamba
uk: в наступну середу
vi: thứ 4 tới

source: this friday
af: hierdie Vrydag
ca: aquest divendres
cs: tento pátek
da: denne fredag
et: see reede
fr: ce vendredi
he: שישי הקרוב
hu: pénteken
it: questo venerdì
ja: 今週の金曜日
km: ថ្ងៃសុក្រនេះ
ko: 이번 금요일
lv: šopiektdien
mk: овој петок
nb_no: tirsdag
nl: deze vrijdag
pl: ten piątek
pt_br: esta sexta-feira
ro: vinerea aceasta
ru: в эту пятницу
sr_latn: u petak
sv: på fredag
tr: bu cuma
uk: в цю п'ятницю
vi: thứ 6 này

source: this monday
af: hierdie Maandag
ca: aquest dilluns
cs: toto pondělí
da: denne mandag
et: see esmaspäev
fr: ce lundi
he: שני הקרוב
hu: hétfőn
it: questo lunedì
ja: 今週の月曜日
km: ថ្ងៃច័ន្ទនេះ
ko: 이번 월요일
lv: šopirmdien
mk: овој понеделник
nb_no: mandag
nl: deze maandag
pl: ten poniedziałek
pt_br: esta segunda-feira
ro: lunea aceasta
ru: в этот понедельник
sr_latn: u ponedeljak
sv: på måndag
tr: bu pazartesi
uk: цього понеділка
vi: thứ 2 này

source: this saturday
af: hierdie Saterdag
ca: aquest dissabte
cs: tuto sobotu
da: denne lørdag
et: see laupäev
fr: ce samedi
he: שבת הקרובה
hu: szombaton
it: questo sabato
ja: 今週の土曜日
km: ថ្ងៃសៅរ៍នេះ
ko: 이번 토요일
lv: šosestdien
mk: оваа сабота
nb_no: lørdag
nl: deze zaterdag
pl: ta sobota
pt_br: este sábado
ro: sambata aceasta
ru: в эту субботу
sr_latn: u subotu
sv: på lördag
tr: bu cumartesi
uk: в цю суботу
vi: thứ 7 này

source: this sunday
af: hierdie Sondag
ca: aquest diumenge
cs: tuto neděli
da: denne søndag
et: see pühapäev
fr: ce dimanche
he: ראשון הקרוב
hu: varásnap
it: questo domenica
ja: 今週の日曜日
km: ថ្ងៃអាទិត្យនេះ
ko: 이번 일요일
lv: šosvētdien
mk: оваа недела
nb_no: søndag
nl: deze zondag
pl: ta niedziela
pt_br: este domingo
ro: duminica aceasta
ru: в это воскресенье
sr_latn: u nedelju
sv: på söndag
tr: bu pazar
uk: в цю неділю
vi: chủ nhật này

source: this thursday
af: hierdie Donderdag
ca: aquest dijous
cs: tento čtvrtek
da: denne torsdag
et: see neljapäev
fr: ce jeudi
he: חמישי הקרוב
hu: csütörtökön
it: questo giovedì
ja: 今週の木曜日
km: ថ្ងៃព្រហស្បតិ៍នេះ
ko: 이번 목요일
lv: šoceturtdien
mk: овој четврок
nb_no: torsdag
nl: deze donderdag
pl: ten czwartek
pt_br: esta quinta-feira
ro: joia aceasta
ru: в этот четверг
sr_latn: u četvrtak
sv: på torsdag
tr: bu perşembe
uk: в цей четвер
vi: thứ 5 này

source: this tuesday
af: hierdie Dinsdag
ca: aquest dimarts
cs: toto úterý
da: denne tirsdag
et: see teisipäev
fr: ce mardi
he: שלישי הקרוב
hu: kedden
it: questo martedì
ja: 今週の火曜日
km: ថ្ងៃអង្គារនេះ
ko: 이번 화요일
lv: šootrdien
mk: овој вторник
nb_no: tirsdag
nl: deze dinsdag
pl: ten wtorek
pt_br: esta terça-feira
ro: martea aceasta
ru: в этот вторник
sr_latn: u utorak
sv: på tisdag
tr: bu salı
uk: цього вівторка
vi: thứ 3 này

source: this wednesday
af: hierdie Woensdag
ca: aquest dimecres
cs: tuto středu
da: denne onsdag
et: see kolmapäev
fr: ce mercredi
he: רביעי הקרוב
hu: szerdán
it: questo mercoledì
ja: 今週の水曜日
km: ថ្ងៃពុធនេះ
ko: 이번 수요일
lv: šotrešdien
mk: оваа среда
nb_no: onsdag
nl: deze woensdag
pl: ta środa
pt_br: esta quarta-feira
ro: miercurea aceasta
ru: в эту среду
sr_latn: u sredu
sv: på onsdag
tr: bu çarşamba
uk: в цю середу
vi: thứ 4 này

source: now
af: nou
ca: ara
cs: teď
da: nu
et: praegu
fr: maintenant
he: עכשיו
hu: most
ja: 今
km: ឥឡូវនេះ
ko: 지금
lv: tagad
mk: сега
nb_no: nå
nl: nu
pl: teraz
ro: acum
ru: сейчас
sr_latn: sada
sv: nu
tr: şimdi
uk: зараз
vi: bây giờ
