Repository: bitwalker/timex
Catalog: priv/translations/*/LC_MESSAGES/units.po
Languages: cs, da, de, es, fi, he, hu, km, lv, pt_br, ro, ru, th, tr, uk, vi, zh_cn

source: %{count} day
cs: %{count} den
da: %{count} dag
de: ein Tag
es: %{count} día
fi: %{count} päivä
he: יום
hu: %{count} nap
km: %{count} ថ្ងៃ
lv: %{count} diena
pt_br: %{count} dia
ro: %{count} zi
ru: %{count} день
th: %{count} วัน
tr: %{count} gün
uk: %{count} день
vi: ${count} ngày
zh_cn: %{count}天

source: %{count} hour
cs: %{count} hodina
da: %{count} time
de: eine Stunde
es: %{count} hora
fi: %{count} tunti
he: שעה
hu: %{count} óra
km: %{count} ម៉ោង
lv: %{count} stunda
pt_br: %{count} hora
ro: %{count} oră
ru: %{count} час
th: %{count} ชั่วโมง
tr: %{count} saat
uk: %{count} година
vi: %{count} giờ
zh_cn: %{count}小时

source: %{count} microsecond
cs: %{count} mikrosekunda
da: %{count} mikrosekund
de: eine Mikrosekunde
es: %{count} microsegundo
fi: %{count} mikrosekunti
he: מיקרו-שניה
hu: %{count} mikroszekundum
km: %{count} មីក្រូវិនាទី
lv: %{count} mikrosekunde
pt_br: %{count} microssegundo
ro: %{count} microsecundă
ru: %{count} микросекунда
th: %{count} ไมโครวินาที
tr: %{count} mikrosaniye
uk: %{count} мікросекунда
vi: %{count} micro giây
zh_cn: %{count}微秒

source: %{count} millisecond
cs: %{count} milisekunda
da: %{count} millisekund
de: eine Millisekunde
es: %{count} milisegundo
fi: %{count} millisekunti
he: מילי-שניה
hu: %{count} miliszekundum
km: %{count} មិល្លីវិនាទី
lv: %{count} milisekunde
pt_br: %{count} milissegundo
ro: %{count} millisecundă
ru: %{count} миллисекунда
th: %{count} มิลลิวินาที
tr: %{count} milisaniye
uk: %{count} мілісекунда
vi: %{count} mili giây
zh_cn: %{count}毫秒

source: %{count} minute
cs: %{count} minuta
da: %{count} minut
de: eine Minute
es: %{count} minuto
fi: %{count} minuutti
he: דקה
hu: %{count} perc
km: %{count} នាទី
lv: %{count} minūte
pt_br: %{count} minuto
ro: %{count} minut
ru: %{count} минута
th: %{count} นาที
tr: %{count} dakika
uk: %{count} хвилина
vi: %{count} phút
zh_cn: %{count}分钟

source: %{count} month
cs: %{count} měsíc
da: %{count} m책ned
de: ein Monat
es: %{count} mes
fi: %{count} kuukausi
he: חודש
hu: %{count} hónap
km: %{count} ខែ
lv: %{count} mēnesis
pt_br: %{count} mÃªs
ro: %{count} lună
ru: %{count} месяц
th: %{count} เดือน
tr: %{count} ay
uk: %{count} місяць
vi: %{count} tháng
zh_cn: %{count}个月

source: %{count} nanosecond
cs: %{count} nanosekunda
da: %{count} nanosekund
de: eine Nanosekunde
es: %{count} nanosegundo
fi: %{count} nanosekunti
he: ננו-שניה
hu: %{count} nanoszekundum
km: %{count} ណាណូវិនាទី
lv: %{count} nanosekunde
pt_br: %{count} nanossegundo
ro: %{count} nanosecundă
ru: %{count} наносекунда
th: %{count} นาโนวินาที
tr: %{count} nanosaniye
uk: %{count} наносекунд
vi: %{count} nano giây
zh_cn: %{count}纳秒

source: %{count} second
cs: %{count} sekunda
da: %{count} sekund
de: eine Sekunde
es: %{count} segundo
fi: %{count} sekunti
he: שניה
hu: %{count} másodperc
km: %{count} វិនាទី
lv: %{count} sekunde
pt_br: %{count} segundo
ro: %{count} secundă
ru: %{count} секунда
th: %{count} วินาที
tr: %{count} saniye
uk: %{count} секунда
vi: %{count} giây
zh_cn: %{count}秒

source: %{count} week
cs: %{count} týden
da: %{count} uge
de: eine Woche
es: %{count} semana
fi: %{count} viikko
he: שבוע
hu: %{count} hét
km: %{count} សប្តាហ៍
lv: %{count} nedēļa
pt_br: %{count} semana
ro: %{count} săptămână
ru: %{count} неделя
th: %{count} สัปดาห์
tr: %{count} hafta
uk: %{count} тиждень
vi: %{count} tuần
zh_cn: %{count}周

source: %{count} year
cs: %{count} rok
da: %{count} 책r
de: ein Jahr
es: %{count} año
fi: %{count} vuosi
he: שנה
hu: %{count} év
km: %{count} ឆ្នាំ
lv: %{count} gads
pt_br: %{count} ano
ro: %{count} an
ru: %{count} год
th: %{count} ปี
tr: %{count} yıl
uk: %{count} рік
vi: %{count} năm
zh_cn: %{count}年
